class MemberCouponOrder:
    """CRM 券-会员-订单关联导出"""
    DF_RESULT_COLUMNS = [
        '券批次类型',
        '券批次类型描述',
        '券活动名称',
        '券批次号',
        '券号',
        '券面额/券折扣',
        '券状态',
        '券生效日期',
        '券失效日期',
        '券绑定日期',
        '券使用日期',
        '管理门店编号',
        '管理门店',
        '会员编号',
        'OpenID',
        '会员名称',
        '会员手机号',
        '消费当前会员等级',
        '消费渠道',
        '消费门店名称',
        '消费门店编号',
        '券使用订单编号',
        '销售金额 (未扣券)',
        '销售金额 (扣券)',
        '吊牌金额',
        '订单件数',
        '订单折扣',
        '券密码'
    ]
    
    CSV_FILE_NAME = 'member_coupon_order_'
