import pandas as pd


HEADER_CRM_DAILY_REPORT_EXCEL = pd.MultiIndex(
    levels=[['区域', '城市', '门店', '销售(累计)', '会员基数(累计)', '贡献度(累计)'],
            ['区域', '城市', '门店', '客户类型', '销售金额', '销售金额占比', '销售金额占比汇总', '去年同期销售金额', '销售同比增长',
             '销售件数', '折扣', '消费会员', '上月存量', '回头率', '会员招募', '会员升级', '店铺数', '店均消费总数',
             '人均销售金额', '人均销售件数', '人均SU', '人均次'],
            ['区域', '城市', '门店', '客户类型', '销售金额', '销售金额占比', '销售金额占比汇总', '去年同期销售金额', '销售同比增长',
             '销售件数', '折扣', '消费会员', '上月存量', '回头率', 'VIP', '普通会员', '会员升级', '店铺数', '店均消费总数',
             '人均销售金额', '人均销售件数', '人均SU', '人均次']],
    labels=[[0, 1, 2, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5],
            [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 14, 15, 16, 17, 18, 19, 20, 21],
            [i for i in range(23)]]
)
